Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/using.tmx
Source language: en
Languages: pl

source: Command line and environment
pl: Wiersz poleceń i środowisko

source: The CPython interpreter scans the command line and the environment for various settings.
pl: interpreter CPython skanuje wiersz poleceń i środowisko w poszukiwaniu różnych ustawień

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
pl: zwyczaje panujące w wierszach poleceń w innych implementacjach mogą się różnić. Zobacz :ref:`implementations` dla dalszych zasobów.

source: Command line
pl: Wiersz poleceń

source: When invoking Python, you may specify any of these options::
pl: wywołując Pythona, możesz podać dowolną z tych opcji::

source: The most common use case is, of course, a simple invocation of a script::
pl: Najczęstszym przypadkiem użycia jest oczywiście zwykłe wywołanie uruchomienia skryptu

source: Interface options
pl: Opcje środowiska

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
pl: Środowisko interpretera przypomina to znane z powłoki UNIXa, ale dostarcza pewne dodatkowe metody wywołania:

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with *Ctrl-D* on UNIX or *Ctrl-Z, Enter* on Windows) is read.
pl: Gdy wzywane ze standardowym wejściem podłączonym do terminala, przyjmuje komendy i wykonuje je aż otrzyma znak EOF (znak końca wiersza, można go wytworzyć używając *Ctrl-D* w UNIXie lub *Ctrl-Z, Enter* w Windows) na wejście.

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
pl: Gdy wezwane z nazwą pliku w argumencie, lub z plikiem na standardowym wejściu, wczytuje i wykonuje skrypt z tego pliku.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
pl: Gdy wezwane z nazwą katalogu jako argument, wczytuje i wykonuje właściwie nazwany skrypt z tego katalogu.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
pl: Gdy wezwane z parametrem ``-c komenda``, wykonuje polecenia Pythona podane jako *komenda*. Tu *komenda* może zawierać wielokrotne polecenia rozdzielone znakami nowego wiersza. Białe znaki na początku wyrażenia mają istotne znaczenie przy wykonywaniu poleceń w Pythonie.

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
pl: Gdy wywołane z ``-m nazwa-modułu``, dany moduł jest poszukiwany w ścieżce modułów Pythona i wykonywany jako skrypt.

source: In non-interactive mode, the entire input is parsed before it is executed.
pl: W trybie wsadowym (nie-interakcyjnym) całe wejście jest wczytywane przed jego wykonaniem.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
pl: Opcje środowiska kończą listę opcji przetwarzanych przez interpreter, wszystkie kolejne argumenty zostaną zakwalifikowane jako :data:`sys.argv` -- Zauważ, że pierwszy element, o indeksie 0 (``sys.argv[0]``), jest napisem wskazującym na źródło programu.

source: Execute the Python code in *command*. *command* can be one ore more statements separated by newlines, with significant leading whitespace as in normal module code.
pl: Wykonaj kod kod Pythona w *komendzie*. *komenda* może być jednym lub więcej wyrażeniami rozdzielonymi znakami nowej linii, ze znaczącymi białymi znakami poprzedzającymi, tak jak w zwykłym kodzie modułu.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
pl: Jeśli ta opcja jest podana, pierwszym elementem :data:`sys.argv` będzie ``"-c"`` i bierzący katalog będzie dodany na początek :data:`sys.path` (pozwalając modułom w tym katalogu na bycie załączonymi jako moduły najwyższego poziomu).

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
pl: Przeszukaj :data:`sys.path` w poszukiwaniu modułu o podanej nazwie i wykonaj jego zawartość jako moduł :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The ``module-name`` should be a valid Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
pl: Ponieważ argument jest nazwą *modułu*, nie podaje się rozszerzenia pliku (``.py``). ``Nazwa-modułu`` powinna być właściwą nazwą modułu Pythona, ale implementacja nie zawsze musi to narzucać (np. może pozwalać na użycie nazwy która zawiera myślnik).

source: Package names are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
pl: Nazwy pakietów są także dozwolone. Gdy nazwa pakietu jest dostarczona zamiast typowego modułu, wtedy interpreter wykona ``<pkg>.__main__`` jako główny moduł. Ta właściwość jest celowo podobna do obsługi katalogów i archiwów które są podawane dla interpretera jako argumenty skryptu.
